# تاپل ها مانند لیست ها هستند فقط دوره انها پرانتز میگذاریم
# تماما رفتاری مشابه لیست ها دارند
tuple1 = (1, 2, 3, 4, "Ali", 3.65)

print(tuple1)
print(tuple1[2])
print(len(tuple1))

# برای تیوپل ها کار نمیکند tuple1[2] = 43 فرقی که دارند این سینتکس مرتبط با ارایه ها یا لیست ها 
# درواقع نمیتوانیم ان را تغییر دهیم با اینکه قابلیت های ارایه را دارد
# اما چرا :
            # درلایه های عمیق تر برنامه نویسی تاپل ها :
            # 1- سریع تر هستند
            # 2- سریع ساخته میشوند
            # 3- بهینه تر هستند
            # 4- میزان حافظه کمتری میگیرند و درنتیجه کار کردن با ان سریع تر است

# میتوانیم به این صورت از ان ها استفاده کنیم

result = ("ayin",28);
firstName,age = result;

print(f"my name is {firstName} Im {age}");